export const accessoryType = {
    1: '支架',
    2: '短手链',
    3: '长手链',
    4: '短挂绳',
    5: '长挂绳',
    6: '水钻贴纸',
    7: '挂钩',
    8: '卡纸',
    9: '透明塑料卡片',
    10: '背夹',
    11: '背部粘贴蝴蝶结',
    12: '链条挂件',
    13: '头套',
    14: '其他配件',
    15: '标签贴',
    16: '刺绣贴',
    17: '树脂贴',
    18: '粘贴珍珠',
    19: '补胶',
    20: '手工腕带',
    21: '黑色布卡片',
    22: '布卡片',
    23: '手链'
}

export const color = {
    101: '蓝色',
    102: '绿色',
    103: '粉色',
    104: '浅粉色',
    105: '奶油白',
    106: '白色',
    107: '灰色',
    108: '黄色',
    109: '棕色',
    110: '卡其色',
    111: '焦糖色',
    112: '橙色',
    113: '红色',
    114: '紫色',
    115: '黑色',
    116: '银色',
    117: '咖啡色',
    118: '玳瑁色',
    119: '墨绿',
    120: '珍珠白',
    121: '金色',
    122: '玫瑰金',
    123: '玫红',
    124: '深红',
    125: '薄荷绿',
    126: '透黄',
    127: '透粉',
    128: '透绿',
    129: '透蓝',
    130: '透白',
    131: '透紫',
    132: '紫灰色',
    133: '浅蓝色',
    134: '深蓝色',
    135: '深棕色',
    136: '彩虹色',
    137: '古铜色',
    138: '透明'
}

export const texture = {
    201: '亮面',
    202: '磨砂',
    203: '哑光',
    204: '条纹'
}

export const suggestMap = {
    0: '下架',
    1: '综合考虑',
    2: '建议下架',
    3: '大于90天，全站0销量'
}

export const listStatusMap = {
    0: 'NORMAL',
    1: 'UNLIST'
}

export const qualityMap = {
    0: '其他',
    1: '划痕',
    2: '黑点',
    3: '气泡',
    4: '色差'
}
