export const orderStatusMap = {
    1: '缺货',
    2: '已拣货',
    3: '已打包', // 订单状态
    4: '待更换',
    5: '已取消', // 订单状态
    6: '已沟通', // 订单状态
    7: '未标记',
    8: '停产',
    9: '已入库',
    10: '仅缺配件',
    11: '仅缺本体',
    12: '换另一款',
    13: '不发货', // 订单状态
    14: '拒收', // 订单状态
    15: '未送仓', // 订单状态
    16: '退货', // 订单状态
    17: '无法供应',
    18: '已送仓',
    19: '紧急',
    20: '当日到仓',
    21: '请送礼物',
    undefined: '正常', // 订单状态
    0: '正常'
}

export const remarkOrderItemStatusList = [{
    id: 2
}, {
    id: 9
}, {
    id: 4
}, {
    id: 12
}, {
    id: 1
}, {
    id: 10
}, {
    id: 11
}, {
    id: 8
}]

export const statusColorMap = {
    1: 'danger',
    8: 'danger',
    6: 'danger',
    5: 'danger',
    2: 'warning',
    3: 'warning',
    9: 'success',
    4: 'warning'
}

export default {
    1: '现货',
    2: '缺货',
    3: '列表隐藏',
    4: '测款结束', // 测款下架
    // 6: '未测款结束'
    5: '热销池',
    7: '等待处理LOGO',
    8: '可发布',
    9: '待更换',
    10: '利润款',
    11: '引流款',
    12: '爆款'
}
